// !!!!!!!!!!!!!!!! Service Worker 
/*
هو ملف عباره عن مجموعه من الايفنتات كل ايفنت مسئول عن حاجه معينه 
زي عندي ايفنت يبدء يجمع الملفات دي ويحطها  في الكاش استورج 
وايفنت يجهز الملفات دي لأي اكشن ممكن اعمل 
وعندي ايفنت يرجع الملفات دي  ويعرضها في الويب سايت غي حاله الموقع شغال اوف لاين 
اول ايفنت هو الريكستر هو المسئول عن تأكيد تسجيل الملف في المتصفح 
ثم الانستول المسئول عن تخزين في الكاش لو تمام وخزن الملفات 
وتبدء ملف الاكتقيت  ودا اي اكشن بيكون جاهز اني اعمل
ايفنت فيتش اني ارجع الملفات تاني في حاله اوف لاين 
هنشئ ملف السيرفسس وركر 
*/
// وهنيجي في الريكستر 
// هاجي في ملف ال app.js